blueskycoco/rt-thread/bsp/tm4c129x/applications/con_common.c
#include "con_socket.h"
#include <rthw.h>
#include <rtthread.h>
#include <rtdevice.h>

#include "board.h"
#include "con_epi.h"
#include "inc/hw_memmap.h"
#include "driverlib/sysctl.h"
#include "driverlib/gpio.h"
#include "driverlib/uart.h"
#include "driverlib/pin_map.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom_map.h"
rt_int32_t g_dev=0;
rt_int8_t 	bus_speed_mode=0;
rt_int32_t times=0;
rt_uint8_t config_local_ip[4+8]				={0xF5,0x8A,0x00,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*local ip*/
rt_uint8_t config_socket0_local_port[2+8]	={0xF5,0x8A,0x01,0xff,0xff,0x26,0xfa,0x00,0x00};					/*local port0*/
rt_uint8_t config_socket1_local_port[2+8]	={0xF5,0x8A,0x02,0xff,0xff,0x26,0xfa,0x00,0x00};					/*local port1*/
rt_uint8_t config_socket2_local_port[2+8]	={0xF5,0x8A,0x03,0xff,0xff,0x26,0xfa,0x00,0x00};					/*local port2*/
rt_uint8_t config_socket3_local_port[2+8]	={0xF5,0x8A,0x04,0xff,0xff,0x26,0xfa,0x00,0x00};					/*local port3*/
rt_uint8_t config_sub_msk[4+8]				={0xF5,0x8A,0x05,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*sub msk*/
rt_uint8_t config_gw[4+8]					={0xF5,0x8A,0x06,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*gw*/
rt_uint8_t config_mac[6+8]					={0xF5,0x8A,0x07,0xff,0xff,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};/*mac*/
rt_uint8_t config_socket0_ip[4+8]			={0xF5,0x8A,0x08,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*socket 0 ip*/
rt_uint8_t config_socket1_ip[4+8]			={0xF5,0x8A,0x09,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*socket 1 ip*/
rt_uint8_t config_socket2_ip[4+8]			={0xF5,0x8A,0x0a,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*socket 2 ip*/
rt_uint8_t config_socket3_ip[4+8]			={0xF5,0x8A,0x0b,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*socket 3 ip*/
rt_uint8_t config_socket0_ip6[64+8]			={0xF5,0x8A,0x0c,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*socket 0 ip6*/
rt_uint8_t config_socket1_ip6[64+8]			={0xF5,0x8A,0x0d,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*socket 1 ip6*/
rt_uint8_t config_socket2_ip6[64+8]			={0xF5,0x8A,0x0e,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*socket 2 ip6*/
rt_uint8_t config_socket3_ip6[64+8]			={0xF5,0x8A,0x0f,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*socket 3 ip6*/
rt_uint8_t config_socket0_remote_port[2+8]	={0xF5,0x8A,0x10,0xff,0xff,0x26,0xfa,0x00,0x00};					/*socket 0 port*/
rt_uint8_t config_socket1_remote_port[2+8]	={0xF5,0x8A,0x11,0xff,0xff,0x26,0xfa,0x00,0x00};					/*socket 1 port*/
rt_uint8_t config_socket2_remote_port[2+8]	={0xF5,0x8A,0x12,0xff,0xff,0x26,0xfa,0x00,0x00};					/*socket 2 port*/
rt_uint8_t config_socket3_remote_port[2+8]	={0xF5,0x8A,0x13,0xff,0xff,0x26,0xfa,0x00,0x00};					/*socket 3 port*/
rt_uint8_t config_net_protol0[1+8]			={0xF5,0x8A,0x14,0xff,0x26,0xfa,0x00,0x00};							/*protol0*/
rt_uint8_t config_net_protol1[1+8]			={0xF5,0x8A,0x15,0xff,0x26,0xfa,0x00,0x00};							/*protol1*/
rt_uint8_t config_net_protol2[1+8]			={0xF5,0x8A,0x16,0xff,0x26,0xfa,0x00,0x00};							/*protol2*/
rt_uint8_t config_net_protol3[1+8]			={0xF5,0x8A,0x17,0xff,0x26,0xfa,0x00,0x00};							/*protol3*/
rt_uint8_t config_socket_mode0[1+8]			={0xF5,0x8A,0x18,0xff,0x26,0xfa,0x00,0x00};							/*server mode0*/
rt_uint8_t config_socket_mode1[1+8]			={0xF5,0x8A,0x19,0xff,0x26,0xfa,0x00,0x00};							/*server mode1*/
rt_uint8_t config_socket_mode2[1+8]			={0xF5,0x8A,0x1a,0xff,0x26,0xfa,0x00,0x00};							/*server mode2*/
rt_uint8_t config_socket_mode3[1+8]			={0xF5,0x8A,0x1b,0xff,0x26,0xfa,0x00,0x00};							/*server mode3*/
rt_uint8_t config_uart_baud0[1+8]			={0xF5,0x8A,0x1c,0xff,0x26,0xfa,0x00,0x00};							/*uart baud*/
rt_uint8_t config_uart_baud1[1+8]			={0xF5,0x8A,0x1d,0xff,0x26,0xfa,0x00,0x00};							/*uart baud*/
rt_uint8_t config_uart_baud2[1+8]			={0xF5,0x8A,0x1e,0xff,0x26,0xfa,0x00,0x00};							/*uart baud*/
rt_uint8_t config_uart_baud3[1+8]			={0xF5,0x8A,0x1f,0xff,0x26,0xfa,0x00,0x00};							/*uart baud*/
rt_uint8_t config_local_ip6[64+8]			={0xF5,0x8A,0x20,0xff,0xff,0xff,0xff,0x26,0xfa,0x00,0x00};			/*local ip6*/
rt_uint8_t config_tcp0[1+8]					={0xF5,0x8A,0x21,0xff,0x26,0xfa,0x00,0x00};							/*protol0*/
rt_uint8_t config_tcp1[1+8]					={0xF5,0x8A,0x22,0xff,0x26,0xfa,0x00,0x00};							/*protol1*/
rt_uint8_t config_tcp2[1+8]					={0xF5,0x8A,0x23,0xff,0x26,0xfa,0x00,0x00};							/*protol2*/
rt_uint8_t config_tcp3[1+8]					={0xF5,0x8A,0x24,0xff,0x26,0xfa,0x00,0x00};							/*protol3*/
static rt_bool_t flag_cnn[4]={RT_FALSE,RT_FALSE,RT_FALSE,RT_FALSE};
rt_thread_t tid_w_thread[4]={RT_NULL,RT_NULL,RT_NULL,RT_NULL};
rt_thread_t tid_r_thread[4]={RT_NULL,RT_NULL,RT_NULL,RT_NULL};
rt_device_t uart_dev[4] = {RT_NULL,RT_NULL,RT_NULL,RT_NULL};
rt_bool_t phy_link=RT_FALSE;
enum STATE_OP{
	GET_F5,
	GET_8A_8B,
	GET_LEN,
	GET_DATA,
	GET_26,
	GET_FA,
	GET_CHECSUM
};
struct rt_semaphore rx_sem[4];

extern void rt_hw_led_on();
extern void rt_hw_led_off();
extern void socket_thread_start(rt_int32_t i);
extern void set_if(rt_int8_t* netif_name, rt_int8_t* ip_addr, rt_int8_t* gw_addr, rt_int8_t* nm_addr);
extern void set_if6(rt_int8_t* netif_name, rt_int8_t* ip6_addr);
extern rt_size_t _usb_init();
extern rt_int32_t _usb_write(rt_int32_t index, void *buffer, rt_int32_t size);
extern void _usb_read(rt_int32_t dev);
rt_int32_t baud(rt_int32_t type);
void print_config(config g);


/*get config data to global config zone, or get socket data to buffer*/
void default_config()
{
	struct netif * netif=netif_list;
	g_conf.config[0]=0;//CONFIG_TCP|CONFIG_IPV6|CONFIG_SERVER;
	g_conf.config[1]=CONFIG_TCP|CONFIG_IPV6;//|CONFIG_SERVER;
	g_conf.config[2]=CONFIG_TCP|CONFIG_IPV6;//|CONFIG_SERVER;
	g_conf.config[3]=CONFIG_TCP|CONFIG_IPV6;//|CONFIG_SERVER;
	memset(g_conf.remote_ip[0],'\0',16);
	strcpy(g_conf.remote_ip[0],"192.168.1.101");
	memset(g_conf.remote_ip[1],'\0',16);
	strcpy(g_conf.remote_ip[1],"192.168.1.103");
	memset(g_conf.remote_ip[2],'\0',16);
	strcpy(g_conf.remote_ip[2],"192.168.1.103");
	memset(g_conf.remote_ip[3],'\0',16);
	strcpy(g_conf.remote_ip[3],"192.168.1.103");
	memset(g_conf.local_ip,'\0',16);
	strcpy(g_conf.local_ip,"192.168.1.103");
	
	memset(g_conf.local_ip6,'\0',64);
	strcpy(g_conf.local_ip6,"fe80::1");
	set_if6("e0","fe80::1");
	memset(g_conf.remote_ip6[0],'\0',64);//fe80::2f0:cfff:fe84:5452%7
	//strcpy(g_conf.remote_ip6[0],"fe80::5867:8730:e9e6:d5c5%11");
	//strcpy(g_conf.remote_ip6[0],"fe80::9132:fea4:7252:16e%13");
	strcpy(g_conf.remote_ip6[0],"fe80::216:17ff:fe89:870b%4");
	memset(g_conf.remote_ip6[1],'\0',64);
	strcpy(g_conf.remote_ip6[1],"fe80::5867:8730:e9e6:d5c5%11");
	//strcpy(g_conf.remote_ip6[1],"fe80::9132:fea4:7252:16e%13");
	memset(g_conf.remote_ip6[2],'\0',64);
	strcpy(g_conf.remote_ip6[2],"fe80::9132:fea4:7252:16e%13");
	memset(g_conf.remote_ip6[3],'\0',64);
	strcpy(g_conf.remote_ip6[3],"fe80::9132:fea4:7252:16e%13");
	g_conf.local_port[0]=1234;
	g_conf.local_port[1]=1235;
	g_conf.local_port[2]=1236;
	g_conf.local_port[3]=1237;	
	memset(g_conf.gw,'\0',16);
	strcpy(g_conf.gw,"192.168.1.1");	
	memset(g_conf.sub_msk,'\0',16);
	strcpy(g_conf.sub_msk,"255.255.255.0");
	memset(g_conf.mac,'\0',64);	
	rt_sprintf(g_conf.mac,"%d.%d.%d.%d.%d.%d",
		netif->hwaddr[0],netif->hwaddr[1],netif->hwaddr[2],netif->hwaddr[3]
		,netif->hwaddr[4],netif->hwaddr[5]);
	g_conf.remote_port[0]=1234;
	g_conf.remote_port[1]=1235;
	g_conf.remote_port[2]=1236;
	g_conf.remote_port[3]=1237;
	set_if("e0",g_conf.local_ip,g_conf.gw,g_conf.sub_msk);
}

//0 no change ,1 local socket need reconfig ,2 all socket need reconfig
void set_config(rt_uint8_t *data,rt_int32_t ipv6_len,rt_int32_t dev)
{
	
	rt_bool_t ipv6_changed = RT_FALSE;
	rt_bool_t ipv4_changed = RT_FALSE;
	rt_int32_t i = 0;
	switch(data[0])
	{
		case 0:
		{
			//set local ipv4 ip
			rt_uint8_t *tmp=rt_malloc(16);
			rt_memset(tmp,'\0',16);
			rt_sprintf(tmp,"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
			if(memcmp(tmp,g_conf.local_ip,16)!=0)
			{
				ipv4_changed=RT_TRUE;
				rt_memset(g_conf.local_ip,'\0',16);
				rt_sprintf(g_conf.local_ip,"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
			}
			rt_free(tmp);
		}
		break;
		case 1:
		case 2:
		case 3:
		case 4:
		{
			//set local port
			if((data[0]-1)==dev)
			{
				if(g_conf.local_port[data[0]-1]!=(data[1]<<8|data[2]))
				{
					g_conf.local_port[data[0]-1]=(data[1]<<8|data[2]);
					g_chang[dev].lpc=1;
					rt_kprintf("local port changed %d\r\n",dev);
				}
			}
		}
		break;
		case 5:
		{
			//set sub msk
			rt_uint8_t *tmp=rt_malloc(16);
			rt_memset(tmp,'\0',16);
			rt_sprintf(tmp,"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
			if(memcmp(tmp,g_conf.sub_msk,16)!=0)
			{
				ipv4_changed=RT_TRUE;
				rt_memset(g_conf.sub_msk,'\0',16);
				rt_sprintf(g_conf.sub_msk,"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
			}
			rt_free(tmp);
		}
		break;
		case 6:
		{
			//set gateway
			rt_uint8_t *tmp=rt_malloc(16);
			rt_memset(tmp,'\0',16);
			rt_sprintf(tmp,"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
			if(memcmp(tmp,g_conf.gw,16)!=0)
			{
				ipv4_changed=RT_TRUE;
				rt_memset(g_conf.gw,'\0',16);
				rt_sprintf(g_conf.gw,"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
			}
			rt_free(tmp);
		}
		break;
		case 7:
		{
			//set mac
			
