blueskycoco/rt-thread/bsp/tm4c129x/applications/con_common.c
		}
		break;
		case 8:
		case 9:
		case 10:
		case 11:
		{
			//set remote ipv4 ip
			if((data[0]-8)==dev)
			{
				rt_uint8_t *tmp=rt_malloc(16);
				rt_memset(tmp,'\0',16);
				rt_sprintf(tmp,"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
				if(memcmp(tmp,g_conf.remote_ip[data[0]-8],16)!=0)
				{
					rt_memset(g_conf.remote_ip[data[0]-8],'\0',16);
					rt_sprintf(g_conf.remote_ip[data[0]-8],"%d.%d.%d.%d",data[1],data[2],data[3],data[4]);
					g_chang[dev].rip4c=1;
				}
				rt_free(tmp);
			}
		}
		break;
		case 12:
		case 13:			
		case 14:
		case 15:
		{
			//set remote ipv6 ip
			if((data[0]-12)==dev)
			{
				rt_uint8_t *tmp=rt_malloc(ipv6_len);
				rt_memset(tmp,'\0',ipv6_len);
				for(i=0;i<ipv6_len;i++)
					tmp[i]=data[i+1];
				if(memcmp(tmp,g_conf.remote_ip6[data[0]-12],ipv6_len)!=0 || ipv6_len!=sizeof(g_conf.remote_ip6[data[0]-12]))
				{
					rt_memset(g_conf.remote_ip6[data[0]-12],'\0',64);
					for(i=0;i<ipv6_len;i++)
						g_conf.remote_ip6[data[0]-12][i]=data[i+1];
					g_chang[dev].rip6c=1;
				}
				rt_free(tmp);
			}
		}
		break;
		case 16:
		case 17:
		case 18:
		case 19:
		{
			//set remote port
			if((data[0]-16)==dev)
			{
				if(g_conf.remote_port[data[0]-16]!=(data[1]<<8|data[2]))
				{
					g_conf.remote_port[data[0]-16]=(data[1]<<8|data[2]);
					g_chang[dev].rpc=1;
				}
			}
		}
		break;
		case 20:
		case 21:
		case 22:
		case 23:
		{
			//set net protol ipv4 or ipv6
			if((data[0]-20)==dev)
			{
				if(data[1])
				{	
					if((g_conf.config[data[0]-20]&CONFIG_IPV6)!=CONFIG_IPV6)
					{
						g_conf.config[data[0]-20]|=CONFIG_IPV6;
						g_chang[dev].protol=1;
					}
				}
				else
				{
					if((g_conf.config[data[0]-20]&CONFIG_IPV6)==CONFIG_IPV6)
					{
						g_conf.config[data[0]-20]&=~CONFIG_IPV6;
						g_chang[dev].protol=1;
					}
				}
			}
		}
		break;
		case 24:
		case 25:
		case 26:
		case 27:
		{
			//set server or client mode
			if((data[0]-24)==dev)
			{
				if(data[1])
				{
					if((g_conf.config[data[0]-24]&CONFIG_SERVER)!=CONFIG_SERVER)
					{
						g_conf.config[data[0]-24]|=CONFIG_SERVER;
						g_chang[dev].cs=1;
					}
				}
				else
				{
					if((g_conf.config[data[0]-24]&CONFIG_SERVER)==CONFIG_SERVER)
					{
						g_conf.config[data[0]-24]&=~CONFIG_SERVER;
						g_chang[dev].cs=1;
					}
				}
			}
		}
		break;
		case 28:
		case 29:
		case 30:
		case 31:
		{
			//set uart baud
			if((data[0]-28)==dev)
			{
				g_conf.config[data[0]-28]=((g_conf.config[data[0]-28]&0x07)|(data[1]<<3));
				struct serial_configure config;
				config.baud_rate=baud(g_conf.config[data[0]-28]>>3);
				config.bit_order = BIT_ORDER_LSB;
				config.data_bits = DATA_BITS_8;
				config.parity	 = PARITY_NONE;
				config.stop_bits = STOP_BITS_1;
				config.invert	 = NRZ_NORMAL;
				config.bufsz	 = RT_SERIAL_RB_BUFSZ;
				rt_device_control(uart_dev[dev],RT_DEVICE_CTRL_CONFIG,&config);	
			}
		}
		break;
		case 32:
		{
			//set local ipv6 ip
			rt_uint8_t *tmp=rt_malloc(ipv6_len);
			rt_memset(tmp,'\0',ipv6_len);
			for(i=0;i<ipv6_len;i++)
				tmp[i]=data[i+1];
			if(memcmp(tmp,g_conf.local_ip6,ipv6_len)!=0 || ipv6_len!=sizeof(g_conf.local_ip6))
			{
				ipv6_changed=RT_TRUE;
				rt_memset(g_conf.local_ip6,'\0',64);
				for(i=0;i<ipv6_len;i++)
					g_conf.local_ip6[i]=data[i+1];
				g_chang[dev].lip6c=1;
			}
			rt_free(tmp);
		}
		break;
		case 33:
		case 34:
		case 35:
		case 36:
		{//set tcp or udp
			if((data[0]-33)==dev)
			{
				if(data[1])
				{
					if((g_conf.config[data[0]-33]&CONFIG_TCP)!=CONFIG_TCP)
					{
						g_conf.config[data[0]-33]|=CONFIG_TCP;
						g_chang[dev].mode=1;
					}
				}
				else
				{
					if((g_conf.config[data[0]-33]&CONFIG_TCP)==CONFIG_TCP)
					{					
						g_conf.config[data[0]-33]&=~CONFIG_TCP;
						g_chang[dev].mode=1;
					}
				}
			}
		}
		break;
		default:
			rt_kprintf("wrong cmd\r\n");
	}
	if(ipv4_changed)
		set_if("e0",g_conf.local_ip,g_conf.gw,g_conf.sub_msk);
	if(ipv6_changed)
		set_if6("e0",g_conf.local_ip6);
}
rt_bool_t need_reconfig(rt_int32_t dev)
{
	if(g_chang[dev].cs||g_chang[dev].lip6c||g_chang[dev].lpc||g_chang[dev].mode||
	   g_chang[dev].protol||g_chang[dev].rip4c||g_chang[dev].rip6c||g_chang[dev].rpc)
	{
		if(g_chang[dev].cs)
			rt_kprintf("%d client/server changed\r\n",dev);
		if(g_chang[dev].lip6c)
			rt_kprintf("%d local ip6 changed\r\n",dev);
		if(g_chang[dev].lpc)
			rt_kprintf("%d local port changed\r\n",dev);
		if(g_chang[dev].mode)
			rt_kprintf("%d tcp/udp changed\r\n",dev);
		if(g_chang[dev].protol)
			rt_kprintf("%d ipv4/ipv6 changed\r\n",dev);
		if(g_chang[dev].rip4c)
			rt_kprintf("%d remote ip4 changed\r\n",dev);
		if(g_chang[dev].rip6c)
			rt_kprintf("%d remote ip6 changed\r\n",dev);
		if(g_chang[dev].rpc)
			rt_kprintf("%d remote port changed\r\n",dev);
		g_chang[dev].cs = 0;g_chang[dev].lip6c = 0;g_chang[dev].lpc = 0;
		g_chang[dev].mode = 0;g_chang[dev].protol = 0;g_chang[dev].rip4c = 0;
		g_chang[dev].rip6c = 0;g_chang[dev].rpc = 0;
		return RT_TRUE;
	}
	else
		return RT_FALSE;
}
void usb_config(rt_uint8_t *data,rt_int32_t ipv6_len,rt_int32_t dev)
{
	set_config(data,ipv6_len,dev);
	print_config(g_conf);
	void *ptr1=(void *)&g_confb;
	void *ptr2=(void *)&g_conf;
	if(rt_memcmp(ptr1,ptr2,sizeof(config))!=0)
	{
		print_config(g_conf);
	}

}
rt_int8_t *send_out(rt_int32_t dev,rt_int32_t cmd,rt_int32_t *lenout)
{
	rt_int8_t *ptr=NULL;
	rt_int32_t crc=0,i=0,len;
	rt_int8_t *p=NULL;
	switch(cmd)
	{
		case 0:
			{
				ptr=config_local_ip;
				p=g_conf.local_ip;
				ptr[3]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[4]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[5]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[6]=atoi(p);
				len=4;
			}
			break;
		case 1:
			{
				if(dev==(cmd-1))
				ptr=config_socket0_local_port;
			}
		case 2:
			{
				if(dev==(cmd-1))
				ptr=config_socket1_local_port;
			}
		case 3:
			{
				if(dev==(cmd-1))
				ptr=config_socket2_local_port;
			}
		case 4:
			{
				if(dev==(cmd-1))
					ptr=config_socket3_local_port;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.local_port[cmd-1]>>8)&0xff;
					ptr[4]=g_conf.local_port[cmd-1]&0xff;
					len=2;
				}				
			}			
			break;
		case 5:
			{
				ptr=config_sub_msk;
				p=g_conf.sub_msk;
				ptr[3]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[4]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[5]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[6]=atoi(p);
				len=4;
			}
			break;
		case 6:
			{
				ptr=config_gw;
				p=g_conf.gw;
				ptr[3]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[4]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[5]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[6]=atoi(p);
				len=4;
			}
			break;
		case 7:
			{
				ptr=config_mac;				
				p=g_conf.mac;
				ptr[3]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[4]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[5]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[6]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[7]=atoi(p);
				while(*p!='.')
					p++;
				p++;
				ptr[8]=atoi(p);
				len=6;
			}
			break;	
		case 8:
			if(dev==(cmd-8))				
			ptr=config_socket0_ip;
		case 9:
			if(dev==(cmd-8))
			ptr=config_socket1_ip;
		case 10:
			if(dev==(cmd-8))
			ptr=config_socket2_ip;
		case 11:
			{
				if(dev==(cmd-8))
				ptr=config_socket3_ip;
				if(ptr!=NULL)
				{
					p=g_conf.remote_ip[cmd-8];
					ptr[3]=atoi(p);
					while(*p!='.')
						p++;
					p++;
					ptr[4]=atoi(p);
					while(*p!='.')
						p++;
					p++;
					ptr[5]=atoi(p);
					while(*p!='.')
						p++;
					p++;
					ptr[6]=atoi(p);
					len=4;
				}
			}
			break;
		case 12:
			if(dev==(cmd-12))
			ptr=config_socket0_ip6;
		case 13:
			if(dev==(cmd-12))
			ptr=config_socket1_ip6;
		case 14:
			if(dev==(cmd-12))
			ptr=config_socket2_ip6;
		case 15:
			{
				if(dev==(cmd-12))
				ptr=config_socket3_ip6;
				if(ptr!=NULL)
				{
					p=g_conf.remote_ip6[cmd-12];
					for(i=0;i<sizeof(g_conf.remote_ip6[cmd-12]);i++)
						ptr[3+i]=p[i];
					len=64;
				}
			}
			break;
		case 16:
			if(dev==(cmd-16))
			ptr=config_socket0_remote_port;
		case 17:
			if(dev==(cmd-16))
			ptr=config_socket1_remote_port;
		case 18:
			if(dev==(cmd-16))
			ptr=config_socket2_remote_port;
		case 19:
			{
				if(dev==(cmd-16))
					ptr=config_socket3_remote_port;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.remote_port[cmd-16]>>8)&0xff;
					ptr[4]=g_conf.remote_port[cmd-16]&0xff;
					len=2;
				}
			}
			break;
		case 20:
			if(dev==(cmd-20))
			ptr=config_net_protol0;
		case 21:
			if(dev==(cmd-20))
			ptr=config_net_protol1;
		case 22:
			if(dev==(cmd-20))
			ptr=config_net_protol2;
		case 23:
			{
				if(dev==(cmd-20))
				ptr=config_net_protol3;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.config[cmd-20]&CONFIG_IPV6)?1:0;
					len=1;
				}
			}
			break;
		case 24:
			if(dev==(cmd-24))
			ptr=config_socket_mode0;
		case 25:
			if(dev==(cmd-24))
			ptr=config_socket_mode1;
		case 26:
			if(dev==(cmd-24))
			ptr=config_socket_mode2;
		case 27:
			{
				if(dev==(cmd-24))
				ptr=config_socket_mode3;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.config[cmd-24]&CONFIG_SERVER)?1:0;
					len=1;
				}
			}
			break;
		case 28:
			if(dev==(cmd-28))
			ptr=config_uart_baud0;
		case 29:
			if(dev==(cmd-28))
			ptr=config_uart_baud1;
		case 30:
			if(dev==(cmd-28))
			ptr=config_uart_baud2;
		case 31:
			{
				if(dev==(cmd-28))
				ptr=config_uart_baud3;
				if(ptr!=NULL)
				{
					ptr[3]=g_conf.config[cmd-28]>>3;
					len=1;
				}
			}
			break;
		case 32:
			{
				ptr=config_local_ip6;
				if(ptr!=NULL)
				{
					p=g_conf.local_ip6;
					for(i=0;i<sizeof(g_conf.local_ip6);i++)
						ptr[3+i]=p[i];
					len=64;
				}
			}
			break;
		case 33:
			if(dev==(cmd-33))
			ptr=config_tcp0;
		case 34:
			if(dev==(cmd-33))
			ptr=config_tcp1;
		case 35:
			if(dev==(cmd-33))
			ptr=config_tcp2;
		case 36:
			{
				if(dev==(cmd-33))
				ptr=config_tcp3;
				if(ptr!=NULL)
				{
					ptr[3]=(g_conf.config[cmd-33]&CONFIG_TCP)?1:0;
					len=1;
				}
			}
			break;

		default:
			break;
	}
	if(ptr!=NULL)
	{
		ptr[0]=0xf5;ptr[1]=0x8b;ptr[2]=cmd;
		ptr[len+3]=0x26;ptr[len+4]=0xfa;
		for(i=0;i<len+5;i++)
			crc=crc+ptr[i];
		ptr[len+5]=(crc>>8)&0xff;
		ptr[len+6]=(crc)&0xff;
		*lenout=len+7;
	}
	return ptr;
}
void all_cut()
{
	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
	MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0); 
	MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0); 
	flag_cnn[0]=RT_FALSE;
	flag_cnn[1]=RT_FALSE;
	flag_cnn[2]=RT_FALSE;
	flag_cnn[3]=RT_FALSE;
}
void cnn_out(rt_int32_t index,rt_int32_t level)
{
	if(phy_link)
	{
		if(level&&(flag_cnn[index]==RT_FALSE))
			flag_cnn[index]=RT_TRUE;
		else if(!level&&(flag_cnn[index]==RT_TRUE))
			flag_cnn[index]=RT_FALSE;
		else
			return;
		rt_kprintf("dev %d , level %d, phy_link %d\r\n",index,level,phy_link);
		switch(index)
		{
			case 0:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);
				else
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				break;
			case 1:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,GPIO_PIN_5);
				else
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
				break;
			case 2:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,GPIO_PIN_2);
				else
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
				break;
			case 3:
				//if(level)
				//;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				//else
				//;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
				break;
			default:
				break;
		}
	}
	else
	{
		MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
		MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
		MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
		flag_cnn[0]=RT_FALSE;
		flag_cnn[1]=RT_FALSE;
		flag_cnn[2]=RT_FALSE;
		flag_cnn[3]=RT_FALSE;
		//MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
	}
}
void print_config(config g)
{
	rt_kprintf("\n============================================================================>\r\n");
	rt_kprintf("local_ip :\t%s\r\n",g.local_ip);
	rt_kprintf("local_ip6 :\t%s\r\n",g.local_ip6);
	rt_kprintf("local_port0 :\t%d\r\n",g.local_port[0]);
	rt_kprintf("local_port1 :\t%d\r\n",g.local_port[1]);
	rt_kprintf("local_port2 :\t%d\r\n",g.local_port[2]);
	rt_kprintf("local_port3 :\t%d\r\n",g.local_port[3]);
	rt_kprintf("sub_msk :\t%s\r\n",g.sub_msk);
	rt_kprintf("gw :\t%s\r\n",g.gw);
	rt_kprintf("mac :\t%s\r\n",g.mac);
	rt_kprintf("remote_ip0 :\t%s\r\n",g.remote_ip[0]);
	rt_kprintf("remote_ip1 :\t%s\r\n",g.remote_ip[1]);
	rt_kprintf("remote_ip2 :\t%s\r\n",g.remote_ip[2]);
	rt_kprintf("remote_ip3 :\t%s\r\n",g.remote_ip[3]);
	rt_kprintf("remote_ip60 :\t%s\r\n",g.remote_ip6[0]);
	rt_kprintf("remote_ip61 :\t%s\r\n",g.remote_ip6[1]);
	rt_kprintf("remote_ip62 :\t%s\r\n",g.remote_ip6[2]);
	rt_kprintf("remote_ip63 :\t%s\r\n",g.remote_ip6[3]);
	rt_kprintf("remote_port0 :\t%d\r\n",g.remote_port[0]);
	rt_kprintf("remote_port1 :\t%d\r\n",g.remote_port[1]);
	rt_kprintf("remote_port2 :\t%d\r\n",g.remote_port[2]);
	rt_kprintf("remote_port3 :\t%d\r\n",g.remote_port[3]);
	rt_kprintf("IP==>\tv4_v6\r\nsocket0 :\t%s\r\nsocket1 :\t%s\r\nsocket2 :\t%s\r\nsocket3 :\t%s\r\n",
		((g.config[0]&0x01)==0)?"IPV4":"IPV6",((g.config[1]&0x01)==0)?"IPV4":"IPV6",
		((g.config[2]&0x01)==0)?"IPV4":"IPV6",((g.config[3]&0x01)==0)?"IPV4":"IPV6");
	rt_kprintf("protol==>\tudp_tcp\r\nsocket0 :\t%s\r\nsocket1 :\t%s\r\nsocket2 :\t%s\r\nsocket3 :\t%s\r\n",
		((g.config[0]&0x02)==0x02)?"TCP":"UDP",((g.config[1]&0x02)==0x02)?"TCP":"UDP",
		((g.config[2]&0x02)==0x02)?"TCP":"UDP",((g.config[3]&0x02)==0x02)?"TCP":"UDP");
	rt_kprintf("mode==>\tclient_server\r\nsocket0 :\t%s\r\nsocket1 :\t%s\r\nsocket2 :\t%s\r\nsocket3 :\t%s\r\n",
		((g.config[0]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[1]&0x04)==0x04)?"SERVER":"CLIENT",
		((g.config[2]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[3]&0x04)==0x04)?"SERVER":"CLIENT");
	rt_kprintf("baud :\t%d.%d.%d.%d\r\n",baud((g.config[0]&0xf8)>>3),baud((g.config[1]&0xf8)>>3),
		baud((g.config[2]&0xf8)>>3),baud((g.config[3]&0xf8)>>3));
	rt_kprintf("\n============================================================================>\r\n");
}

void usb_w_thread(void* parameter)
{
	rt_int32_t dev=((rt_int32_t)parameter)/2;
	rt_kprintf("usb_w_thread %d\r\n",dev);
	while(1)
		_usb_read(dev);
}

static void common_r(void* parameter)
{
    rt_size_t data_size;
    const void *last_data_ptr=RT_NULL;
	void *data_ptr;
	rt_int32_t dev=(rt_int32_t)parameter;
	rt_err_t r=RT_EFULL;	
    rt_kprintf("common_r %d Enter\r\n",(dev-1)/2);
	while(1)
	{
		r=rt_data_queue_pop(&g_data_queue[dev], &last_data_ptr, &data_size, RT_WAITING_FOREVER);
		if(r==RT_EOK && data_size!=0 && last_data_ptr)
		{
			if(g_dev==1)
			{
				_usb_write(dev,(void *)last_data_ptr,data_size);
			}
			else if(g_dev==2)
			{
				_epi_write((dev-1)/2,last_data_ptr,data_size,0x04+(dev-1)/2);
			}
			else
				rt_device_write(uart_dev[(dev-1)/2], 0, last_data_ptr, data_size);
			if(last_data_ptr)
			{
				rt_free((void *)last_data_ptr);
				last_data_ptr=RT_NULL;
			}
		}
	}
}
/*init common1,2,3,4 for 4 socket*/
rt_int32_t common_init(rt_int32_t dev)//0 uart , 1 parallel bus, 2 usb
{
	/*init common device*/
	rt_err_t result;
	rt_uint8_t common[100];
	rt_int32_t i,max_devices=4;
	/*read config data from internal flash*/
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
	MAP_SysCtlDelay(1);
	//config select
	MAP_GPIOIntDisable(GPIO_PORTD_BASE, GPIO_PIN_2);
	MAP_GPIOPinTypeGPIOInput(GPIO_PORTD_BASE, GPIO_PIN_2);//ind0
	MAP_GPIOIntTypeSet(GPIO_PORTD_BASE, GPIO_PIN_2, GPIO_BOTH_EDGES);
	MAP_IntEnable(INT_GPIOD);
	MAP_GPIOIntEnable(GPIO_PORTD_BASE, GPIO_PIN_2);
	rt_int32_t ui32Status = MAP_GPIOIntStatus(GPIO_PORTD_BASE, RT_TRUE);
	MAP_GPIOIntClear(GPIO_PORTD_BASE, ui32Status);
	//connect ind
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTE_BASE, GPIO_PIN_5);//CNN1
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_2);//CNN2
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_3);//CNN3
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_4);//CNN4
	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
	MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);
	MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);
	//init GPJ0 rt_int32_t
	MAP_GPIOIntDisable(GPIO_PORTJ_BASE, GPIO_PIN_0);
	MAP_GPIOPinTypeGPIOInput(GPIO_PORTJ_BASE, GPIO_PIN_0);
	MAP_GPIOIntTypeSet(GPIO_PORTJ_BASE, GPIO_PIN_0, GPIO_FALLING_EDGE);
	MAP_IntEnable(INT_GPIOJ);
	MAP_GPIOIntEnable(GPIO_PORTJ_BASE, GPIO_PIN_0);
	ui32Status = MAP_GPIOIntStatus(GPIO_PORTJ_BASE, RT_TRUE);
	MAP_GPIOIntClear(GPIO_PORTJ_BASE, ui32Status);

	default_config();
	memset(config_local_ip,0,11);config_local_ip[11]='\0';
	memset(config_sub_msk,0,11);config_sub_msk[11]='\0';
	memset(config_gw,0,11);config_gw[11]='\0';
	memset(config_socket3_ip,0,11);config_socket0_ip[11]='\0';
	memset(config_socket0_ip,0,11);config_socket1_ip[11]='\0';
	memset(config_socket1_ip,0,11);config_socket2_ip[11]='\0';
	memset(config_socket2_ip,0,11);config_socket3_ip[11]='\0';
	memset(config_socket0_local_port,0,9);config_socket0_local_port[9]='\0';
	memset(config_socket1_local_port,0,9);config_socket1_local_port[9]='\0';
	memset(config_socket2_local_port,0,9);config_socket2_local_port[9]='\0';
	memset(config_socket3_local_port,0,9);config_socket3_local_port[9]='\0';
	memset(config_socket0_remote_port,0,9);config_socket0_remote_port[9]='\0';
	memset(config_socket1_remote_port,0,9);config_socket1_remote_port[9]='\0';
	memset(config_socket2_remote_port,0,9);config_socket2_remote_port[9]='\0';
	memset(config_socket3_remote_port,0,9);config_socket3_remote_port[9]='\0';
	memset(config_mac,0,13);config_mac[13]='\0';
	memset(config_socket0_ip6,0,71);config_socket0_ip6[71]='\0';
	memset(config_socket1_ip6,0,71);config_socket1_ip6[71]='\0';
	memset(config_socket2_ip6,0,71);config_socket2_ip6[71]='\0';
	memset(config_socket3_ip6,0,71);config_socket3_ip6[71]='\0';
	memset(config_local_ip6,0,71);config_local_ip6[71]='\0';
	memset(config_net_protol0,0,8);config_net_protol0[8]='\0';
	memset(config_net_protol1,0,8);config_net_protol1[8]='\0';
	memset(config_net_protol2,0,8);config_net_protol2[8]='\0';
	memset(config_net_protol3,0,8);config_net_protol3[8]='\0';
	memset(config_socket_mode0,0,8);config_socket_mode0[8]='\0';
	memset(config_socket_mode1,0,8);config_socket_mode1[8]='\0';
	memset(config_socket_mode2,0,8);config_socket_mode2[8]='\0';
	memset(config_socket_mode3,0,8);config_socket_mode3[8]='\0';
	memset(config_uart_baud0,0,8);config_uart_baud0[8]='\0';
	memset(config_uart_baud1,0,8);config_uart_baud1[8]='\0';
	memset(config_uart_baud2,0,8);config_uart_baud2[8]='\0';
	memset(config_uart_baud3,0,8);config_uart_baud3[8]='\0';
	memset(config_tcp0,0,8);config_tcp0[8]='\0';
	memset(config_tcp1,0,8);config_tcp1[8]='\0';
	memset(config_tcp2,0,8);config_tcp2[8]='\0';
	memset(config_tcp3,0,8);config_tcp3[8]='\0';
	rt_mutex_init(&config_mutex, "config_mutex", RT_IPC_FLAG_FIFO);

	if(dev==DEV_USB)
	{
		max_devices=2;
		g_dev=1;
	}
	if(dev==DEV_BUS)
	{
		max_devices=1;
		g_dev=2;
	}
	for(i=0;i<max_devices;i++)
	{
		//config sem		
		if(dev!=DEV_USB)
		{			
			rt_sprintf(common,"common_%d_rx",i);
			rt_sem_init(&(rx_sem[i]), common, 0, 0);
		}
		if(dev==DEV_UART)
		{
			if(i==1)
				rt_sprintf(common,"uart%d",4);
			else
				rt_sprintf(common,"uart%d",i);		
			DBG("To open ==>%s\r\n",common);
			//open uart ,parallel ,usb
			uart_dev[i] = rt_device_find(common);
			if (uart_dev[i] == RT_NULL)
			{
				DBG("app_common: can not find device: %s\r\n",common);
				return 0;
			}
			if (rt_device_open(uart_dev[i], RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX | RT_DEVICE_FLAG_INT_TX) == RT_EOK)
			{
				//create common_w,r thread to read data from socket write to uart,parallel,usb
				//or read from uart,parallel,usb write to socket
				rt_int8_t buf[32]="DEV Opened";
				rt_sprintf(common,"common_wx%d",i);
				tid_w_thread[i] = rt_thread_create(common,uart_w_thread, (void *)(i*2),4096, 20, 10);
				rt_sprintf(common,"common_rx%d",i);
				tid_r_thread[i] = rt_thread_create(common,common_r, (void *)(i*2+1),2048, 20, 10);
				rt_device_write(uart_dev[i], 0, buf, strlen(buf));
				rt_device_set_rx_indicate(uart_dev[i], uart_rx_ind);
				if(tid_w_thread[i]!=RT_NULL)
					rt_thread_startup(tid_w_thread[i]);			
				if(tid_r_thread[i]!=RT_NULL)
					rt_thread_startup(tid_r_thread[i]);
			}
		}
		else if(dev==DEV_BUS)
		{			
			if(bus_speed_mode==0)
			{
				epi_init();
				rt_sprintf(common,"epi_%d_rx",i);
				rt_sem_init(&(rx_sem[i]), common, 0, 0);			
				rt_kprintf("epi %d\r\n",i);
				rt_sprintf(common,"common_wx%d",i);
				tid_w_thread[i] = rt_thread_create(common,epi_w_thread, (void *)(i*2),2048, 20, 10);	
				if(tid_w_thread[i]!=RT_NULL)
					rt_thread_startup(tid_w_thread[i]);								
				rt_sprintf(common,"common_rx%d",i);
				tid_r_thread[i] = rt_thread_create(common,common_r, (void *)(i*2+1),4096, 20, 10);
				if(tid_r_thread[i]!=RT_NULL)
					rt_thread_startup(tid_r_thread[i]);
			}
			else
				epi_init();
		}
		else
		{
			//init usbbulk,read data from usb,and transfer data to 4 socket thread by 4 ctl line
			//create 4 common_r thread read data from 4 socket thread,and put data to usb,control 4 ind line
			if(i==0)
				_usb_init();
			rt_kprintf("uub %d\r\n",i);
			rt_sprintf(common,"common_wx%d",i);
			tid_w_thread[i] = rt_thread_create(common,usb_w_thread, (void *)(i*2),4096, 20, 10);	
			if(tid_w_thread[i]!=RT_NULL)
				rt_thread_startup(tid_w_thread[i]);	
			if(i==0)
			{
				rt_sprintf(common,"common_rx%d",i);
				tid_r_thread[i] = rt_thread_create(common,common_r, (void *)(i*2+1),2048, 20, 10);
				if(tid_r_thread[i]!=RT_NULL)
					rt_thread_startup(tid_r_thread[i]);
			}
		}
	}
	print_config(g_conf);
	if(bus_speed_mode==0)
	{
		if(dev==DEV_USB||dev==DEV_BUS)
		{
			g_chang[0].cs=0;g_chang[0].lip6c=0;g_chang[0].lpc=0;g_chang[0].mode=0;
			g_chang[0].protol=0;g_chang[0].rip4c=0;g_chang[0].rip6c=0;g_chang[0].rpc=0;
			socket_thread_start(0);
		}	
		else
		{
			for(i=0;i<4;i++)
			{
				g_chang[i].cs=0;g_chang[i].lip6c=0;g_chang[i].lpc=0;g_chang[i].mode=0;
				g_chang[i].protol=0;g_chang[i].rip4c=0;g_chang[i].rip6c=0;g_chang[i].rpc=0;
				socket_thread_start(i);
			}
		}
		DBG("common_init ok\r\n");
	}
	else
		rt_thread_startup(rt_thread_create("bus_speed",bus_speed_test, 0,4096, 20, 10));
	return 1;
}
